#1)შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ გაანახლეთ ამ ცვლადის მნიშვნელობა ორჯერ, საბოლოოდ კი დაპრინტეთ ეს ცვლადი.

#ცვლადის შექმნა
points = 50
#განახევრება
points /= 2
print(points)

#2)დაწერეთ 10 ხაზი კოდი (შეცდომებით) და ქვევით მიუწერეთ სწორი ვერისა

#ცვლადი გამოძახებულია მაშინ როცა ის არ არის შექმნილი ამიტომ კოდი არ გაიგზავნა სწორად
print(num)
num = 21
#სწორი არის
num = 21
print(num)



#შეცდომა ისაა რომ ცვლადზე მნიშვნელობის მინიჭების დროს არაა გამოყენებული ტოლობის სიმბოლო
num= 7 
num -- 8
print (num)
#სწორი არის
num =7
num = 8
print(num)


#შეცდმა ისაა რომ რიცხვის და სტრინგის შეკრება ვერ მოხერხდება. საჭიროა ორივე ცვლადი იყოს ერთი და იგივე ტიპის
num = 5
text = "hello"
result = num + text
print(result)
#სწორი არის
num1 = 5
num2 = 10
result = num1 + num2
print(result)

#შეცდომა ისაა რომ ცვლადი num2 არ არის შემოღებული მანამდე, ამიტომ ეს იქნება შეცდომა. num2 უნდა განისაზღვროს წინასწარ
num1 = num2 + 10
print(num1)
#სწორია
num1 = 20
num2 = 10
num1 = num2 + 10
print(num1)



#ნულზე გაყოფა შეუძლებელია ამიტომ პროგრამა შეცდომას გამოიტანს
num1 = 10
num2 = 0
result = num1 / num2
print(result)
#სწორია
num1 = 10
num2 = 5
result = num1 / num2 
print(result)


#Num და num განსხვავებული ცვლადებია
Num = 5
num = 10
print(Num + num1)
#სწორია
num = 5
num1 = 10
print(num + num1)


#სტრინგის დასაწყისში და დასასრულში ბრჭყალები უნდა ემთხვეოდეს
text = "hello, world!' " 
print(text)
#სწორია
text = "hello, world"
print(text)











#3)შექმენით ცვლადი სადაც შეინახავთ თქვენს საყვარელ რიცხვს, შექმენით მეორე ცვლადი სადაც შეინახავთ თქვენს ასაკს და შექმენით მესამე ცვლადი სადაც შეინახავთ ამ ცვლადების ნამრავლს.
favorite_numbers = 102
age = 15
result = favorite_numbers * age
print(result)






#4)ცვლადების მეშვეობით დაბეჭდეთ მათემატიკური გამოსახულებელი, ყველა განვილილი მათემატიკური ოპერატორით.
num1 = 10
num2 = 20
#შეკრება
num1 + num

#გამოკლება
num1 - num2

#გამრავლება 
num1 * num2

#გაყოფა
num1 / num2

#მთელი რიცხვით გაყოფა
num1 // num2