num1 = (input("enter the first number: "))
num2 = (input("enter the second number: "))

print(num1 + num2)
print(num1 * num2)
print(num1 - num2)


#2)ახსენით კომენტარებით რაში გვჭირდება საუკეთესო პრაქტიკები პროგრამირებაში, ასევე ახსენით რა არის snake case და case sensitivity

#1.საუკეთესო პრაქტიკები გვეხმარება რომ კოდი იყოს სუფთა ადვილად გასაგები და ნაკლები შეცდომა ჰქონდეს
#2.snake case არის წერის სტილი სადაც სიტყვებს შორის ქვედატირე იწერება (_) რომ წერის სტილი უფრო გასაგები იყოს
#3.case sensitivity ნიშნავს რომ პროგრამირების ენები განსხვავებულად ააღიქვამენ დიდ და პატარა ასოებს