 #1) შექმენით 2 ცვლადი და მესამე ცვლადში შეინახეთ, წინა ორი ცვლადის მნიშვნელობების ჯამი და გამოიტანეთ შედეგი ეკრანზე.
num1 = 7
num2 = 8
result = num1 + num2
print (result)


#2)დაწერეთ 5 არასწორი კოდი, გაასწორეთ მათში შეცომები და კომენტარებით ახსენით რა შეცდომები იყო კოდში და დაწერეთ გასწორებული ვერსია


#ცვლადი გამოძახებულია მაშინ როცა ის არ არის შექმნილი ამიტომ კოდი არ გაიგზავნა სწორად
print(num)
num = 21
#სწორი არის
num = 21
print(num)



#შეცდომა ისაა რომ ცვლადზე მნიშვნელობის მინიჭების დროს არაა გამოყენებული ტოლობის სიმბოლო
num= 7 
num -- 8
print (num)
#სწორი არის
num =7
num = 8
print(num)


#შეცდმა ისაა რომ რიცხვის და სტრინგის შეკრება ვერ მოხერხდება. საჭიროა ორივე ცვლადი იყოს ერთი და იგივე ტიპის
num = 5
text = "hello"
result = num + text
print(result)
#სწორი არის
num1 = 5
num2 = 10
result = num1 + num2
print(result)

#შეცდომა ისაა რომ ცვლადი num2 არ არის შემოღებული მანამდე, ამიტომ ეს იქნება შეცდომა. num2 უნდა განისაზღვროს წინასწარ
num1 = num2 + 10
print(num1)
#სწორია
num1 = 20
num2 = 10
num1 = num2 + 10
print(num1)



#ნულზე გაყოფა შეუძლებელია ამიტომ პროგრამა შეცდომას გამოიტანს
num1 = 10
num2 = 0
result = num1 / num2
print(result)
#სწორია
num1 = 10
num2 = 5
result = num1 / num2 
print(result)


# Debugging -> კოდში შცდომების ჩასწორება